---
kind: other
id: Properties.T:Autodesk.Revit.UI.TaskDialog
zh: 提示、弹窗、消息框
source: html/a07765ed-483d-4c36-c521-f84554f06191.htm
---
# TaskDialog Properties

**中文**: 提示、弹窗、消息框

Whether the task dialog can be cancelled if no cancel button is specified.